In [1]:
import pandas as pd

#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [2]:
df

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D    A       9        6
E    B      12        6
F    B       9        5
G    B       9        9
H    B       4       12

In [ ]:
#loc is use to select rows and columns with specific labels
#iloc selects rows and columns at specific integer positions

In [8]:
df[['team','points']]

  team  points
A    A       5
B    A       7
C    A       7
D    A       9
E    B      12
F    B       9
G    B       9
H    B       4

In [11]:
#SELECTING ROWS BASED ON INDEX E AND H

df.loc[['E', 'H']]

  team  points  assists
E    B      12        6
H    B       4       12

In [13]:
# We can use loc to select specific rows and specific columns of the /
# /DataFrame based on their labels:


df.loc[['D', 'F'], ['points', 'assists']]

   points  assists
D       9        6
F       9        5

In [18]:
#select from 'D' rows and 'team' and 'assists' columns
df.loc['E': , :'assists']

  team  points  assists
E    B      12        6
F    B       9        5
G    B       9        9
H    B       4       12

In [ ]:
#using iloc in pandas to slice dataframe

In [21]:
import pandas as pd

#create DataFrame
df2 = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4],
                   'assists': [11, 8, 10, 6, 6, 5, 9, 12]},
                   index=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

In [22]:
df2

  team  points  assists
A    A       5       11
B    A       7        8
C    A       7       10
D    A       9        6
E    B      12        6
F    B       9        5
G    B       9        9
H    B       4       12

In [28]:
df2.iloc[6]

team       B
points     9
assists    9
Name: G, dtype: object

In [30]:
#select rows in index positions 4 through 6 (not including 6)
df2.iloc[4:6]

  team  points  assists
E    B      12        6
F    B       9        5

In [31]:
#select rows in range 4 through 6 and columns in range 0 through 2
df.iloc[4:6, 0:2]

  team  points
E    B      12
F    B       9

In [37]:
#select rows from 3 through end of rows and columns up to third column
df.iloc[3: , :3]

  team  points  assists
D    A       9        6
E    B      12        6
F    B       9        5
G    B       9        9
H    B       4       12